Tekla Open API Reference for Tekla Structures 2025
DimensionTextAttributes Constructor
Overload List
Name | Description
DimensionSetBaseAttributes.DimensionTextAttributes()
 Creates a new dimension text attributes instance. By default the default font is used, no frame is drawn and the value text is above the dimension line.
DimensionSetBaseAttributes.DimensionTextAttributes(FontAttributes, DimensionSetBaseAttributes.FrameTypes, DimensionSetBaseAttributes.DimensionTextPlacings)
 Creates a new dimension text attributes instance with the given parameters.
Top
See Also
Reference
DimensionSetBaseAttributes.DimensionTextAttributes Class
Tekla.Structures.Drawing Namespace